Revit 2026 API

# View3DSetSectionBox Method

---

Sets the section box for this 3D view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSectionBox(
	BoundingBoxXYZ boundingBoxXYZ
)
```
```vb
Public Sub SetSectionBox (
	boundingBoxXYZ As BoundingBoxXYZ
)
```
```cpp
public:
void SetSectionBox(
	BoundingBoxXYZ^ boundingBoxXYZ
)
```
```fsharp
member SetSectionBox :
        boundingBoxXYZ : BoundingBoxXYZ -> unit
```

#### Parameters

boundingBoxXYZ BoundingBoxXYZ
     The bounding box to use for the section box. To turn off the section box, set IsSectionBoxActive to false. Individual bound enabled flags in the input box are ignored.

| Exception | Condition |
| --- | --- |
| ArgumentException | Bounding box cannot be empty. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Returns true if the view is not a view template. |

#### Reference

View3D Class

Autodesk.Revit.DB Namespace